---
title: ThermalAsset
classe: Autodesk.Revit.DB.ThermalAsset
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 21
---

# ThermalAsset

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StructuralBehavior Behavior { get; set; }` | `thermalAsset.Behavior` | StructuralBehavior |
| `Double Compressibility { get; set; }` | `thermalAsset.Compressibility` | Double |
| `Double Density { get; set; }` | `thermalAsset.Density` | Double |
| `Double ElectricalResistivity { get; set; }` | `thermalAsset.ElectricalResistivity` | Double |
| `Double Emissivity { get; set; }` | `thermalAsset.Emissivity` | Double |
| `Double GasViscosity { get; set; }` | `thermalAsset.GasViscosity` | Double |
| `Boolean IsValidObject { get; }` | `thermalAsset.IsValidObject` | Boolean |
| `Double LiquidViscosity { get; set; }` | `thermalAsset.LiquidViscosity` | Double |
| `String Name { get; set; }` | `thermalAsset.Name` | String |
| `Double Permeability { get; set; }` | `thermalAsset.Permeability` | Double |
| `Double Porosity { get; set; }` | `thermalAsset.Porosity` | Double |
| `Double Reflectivity { get; set; }` | `thermalAsset.Reflectivity` | Double |
| `Double SpecificHeat { get; set; }` | `thermalAsset.SpecificHeat` | Double |
| `Double SpecificHeatOfVaporization { get; set; }` | `thermalAsset.SpecificHeatOfVaporization` | Double |
| `Double ThermalConductivity { get; set; }` | `thermalAsset.ThermalConductivity` | Double |
| `ThermalMaterialType ThermalMaterialType { get; }` | `thermalAsset.ThermalMaterialType` | ThermalMaterialType |
| `Boolean TransmitsLight { get; set; }` | `thermalAsset.TransmitsLight` | Boolean |
| `Double VaporPressure { get; set; }` | `thermalAsset.VaporPressure` | Double |
| `ThermalAsset Copy()` | `thermalAsset.Copy()` | ThermalAsset |
| `Void Dispose()` | `thermalAsset.Dispose()` | Void |
| `Boolean EqualsThermalOnly(ThermalAsset)` | `thermalAsset.EqualsThermalOnly(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```